{
  "news": {
    "local": [
      {
        "category": "local",
        "title": "Justice Served: DSS Apprehends Kidnappers Behind 2023 Abduction and Murder of Neurology Professor",
        "image": "https://i.postimg.cc/Pqqps0fH/Screenshot-2025-12-29-122741.png",
        "summary": "The Department of State Services (DSS) has successfully tracked down and arrested the criminal gang responsible for the kidnapping and subsequent killing of a prominent Professor of Neurology over a year ago",
        "fullText": "In a significant breakthrough for Nigeria's domestic intelligence agency, the Department of State Services (DSS) has announced the arrest of a notorious kidnapping syndicate linked to the tragic death of a distinguished Professor of Neurology. The academic, whose abduction in 2023 sent shockwaves through the medical and academic communities, was killed by his captors despite negotiations, a crime that led to a long-term undercover investigation by state operatives.\n\nThe DSS revealed that the suspects were apprehended following a coordinated sting operation that spanned multiple states. Investigators utilized advanced forensic tracking and human intelligence to locate the gang members, who had been on the run since the incident. During the arrests, security forces recovered several items linking the group to the crime scene, as well as weaponry used in their various operations across the region.\n\nThe agency noted that the gang confessed to the abduction, admitting that the professor was targeted due to his perceived profile. The suspects further disclosed the location of the remains, which has allowed the authorities to conclude a significant portion of the investigation. This successful operation is being hailed as a major win for the DSS in its ongoing battle against high-profile kidnapping rings that have targeted professionals and academics in recent years.\n\nThe suspects are currently in custody and are expected to be arraigned in court as soon as preliminary judicial processes are completed. The DSS reaffirmed its commitment to tracking down all individuals involved in violent crimes, stressing that the delay in the arrest was due to the meticulous nature of the evidence-gathering required to ensure a successful prosecution and to dismantle the entire network associated with the group.",
        "date": "2025-12-29T11:42:10.123Z"
      },
      {
        "category": "local",
        "title": "Terrorists Relocate After US Air Strikes in Nigeria",
        "image": "https://i.postimg.cc/Kj6m1JNf/20251228-102608.jpg",
        "summary": "Reports say suspected terrorists in northwest Nigeria are moving locations after US-led air strikes disrupted their camps. Community leaders and officials warn security risks remain high.",
        "fullText": "Residents in parts of northwest Nigeria report unusual movement of armed groups following recent US military air strikes. The strikes targeted locations believed to serve as terrorist hideouts during the Christmas period.\nCommunity leaders say the attacks forced the groups to abandon fixed camps and split into smaller units. Many reportedly moved through forest routes and rural corridors to avoid detection.\nIn some affected areas, residents confirmed damage to farmland and nearby structures. A few civilians sustained injuries, increasing tension among local populations.\nTraditional rulers and security sources warn the relocation poses new risks. Armed groups entering unfamiliar communities often seek supplies, shelter, or recruits.\nSecurity agencies have increased patrols and surveillance across border towns and forest zones. Officials say coordinated operations are underway to block escape paths and prevent regrouping.\nAnalysts stress the need for stronger intelligence sharing and sustained pressure. Without follow up action, displaced groups often reorganize and resume attacks.",
        "date": "2025-12-28T09:26:39.526Z"
      }
    ],
    "tech": [
      {
        "category": "tech",
        "title": "Israel's Tech Sector Faces Brain Drain Crisis as Staff Seek Relocation Abroad",
        "image": "https://i.postimg.cc/zvxsjQzk/Screenshot-2025-12-28-205438.png",
        "summary": "A new report reveals a significant rise in Israeli technology workers seeking to move overseas, driven by ongoing regional instability and economic uncertainty.",
        "fullText": "The backbone of Israel's economy is showing signs of strain as a growing number of tech professionals explore opportunities outside the country. According to a recent industry report, the prolonged conflict and the resulting social and economic volatility have triggered a surge in relocation requests among high-tech employees. This trend poses a serious threat to Israel's status as a global innovation hub, as the \"Startup Nation\" risks losing its most valuable talent to more stable markets in Europe and North America.\n\nTech leaders and CEOs expressed concern that the flight of human capital could lead to a long-term decline in domestic investment and research development. While the sector has remained resilient during previous crises, the current data suggests that the duration of the unrest is pushing even senior-level engineers and entrepreneurs to seek a more predictable future elsewhere. Experts warn that without significant shifts in the geopolitical climate or targeted government intervention to retain talent, the exodus could permanently reshape the landscape of the Israeli technology industry.",
        "date": "2025-12-28T19:55:29.689Z"
      }
    ],
    "finance": [
      {
        "category": "finance",
        "title": "Aviation Crisis: Air Peace CEO Warns New Tax Law Could Force ₦1 Million Base Fare",
        "image": "https://i.postimg.cc/XJRRD5Fz/Screenshot-2025-12-28-211245.png",
        "summary": "Air Peace Chairman, Allen Onyema, has cautioned that the reintroduction of certain taxes and duties could lead to a collapse of the aviation sector and sky-high ticket prices for Nigerians.",
        "fullText": "     The Chairman of Air Peace, Dr. Allen Onyema, has raised an alarm over a proposed new tax regime that could see domestic airfares soar to a ₦1 million base rate. Speaking at a recent aviation conference in Lagos, Onyema warned that the implementation of policies such as customs duties on imported aircraft, spare parts, and a 7.5% VAT on fares would be \"disastrous\" for the industry. He stated that these financial burdens would likely cause many Nigerian airlines to collapse within 48 hours of enforcement.\n\n     Onyema emphasized that Nigerian carriers are already struggling with high operating costs and multiple existing taxes, including the 5% ticket sales charge. He urged the government to review these laws to prevent the \"death\" of local aviation, suggesting that the industry should focus on cost-recovery rather than aggressive taxation. While he praised Aviation Minister Festus Keyamo for addressing these concerns, the Air Peace boss maintained that without a permanent shift in policy, air travel could become unaffordable for the average Nigerian.",
        "date": "2025-12-28T20:09:55.861Z"
      }
    ],
    "international": [
      {
        "category": "international",
        "title": "Historic Florida Summit: Trump Hosts Zelenskyy in Bid to Negotiate Russia-Ukraine Peace",
        "image": "https://i.postimg.cc/RhcZP469/Screenshot-2025-12-28-212123.png",
        "summary": "U.S. President Donald Trump is hosting Ukrainian President Volodymyr Zelenskyy in Florida today for high-stakes talks aimed at establishing a ceasefire and a lasting peace agreement.",
        "fullText": "In a pivotal moment for global diplomacy, President Donald Trump met with Ukrainian President Volodymyr Zelenskyy at his Florida estate this Sunday. The meeting follows what Trump described as a \"very productive\" phone call with Russian President Vladimir Putin earlier in the day. Zelenskyy told reporters that the primary focus of the discussion is securing long-term security guarantees for Ukraine as they look toward an end to the nearly four-year conflict.\n\nThe summit comes amid a backdrop of intensified Russian strikes on Kyiv and shifting U.S. foreign policy. While the Kremlin has expressed a willingness to talk, the Ukrainian leadership remains cautious, emphasizing that any deal must protect their nation's sovereignty. Analysts suggest this meeting could be the most significant breakthrough in peace negotiations since the war began, as the Trump administration pushes for a rapid resolution to the crisis. Updates from the Florida summit are expected throughout the evening.",
        "date": "2025-12-28T20:22:13.808Z"
      }
    ],
    "sports": [
      {
        "category": "sports",
        "title": "\"It Pains Me When I Concede\" – Super Eagles Goalkeeper Stanley Nwabali Opens Up",
        "image": "https://i.postimg.cc/kG62HSy1/Screenshot-2025-12-29-131419.png",
        "summary": "Super Eagles shot-stopper Stanley Nwabali has expressed his deep passion for keeping clean sheets, revealing the emotional toll of conceding goals as Nigeria prepares for the 2025 Africa Cup of Nations.",
        "fullText": "As the countdown to the 2025 Africa Cup of Nations (AFCON) intensifies, Nigeria’s first-choice goalkeeper, Stanley Nwabali, has shared insights into his competitive mindset and his obsession with defensive perfection. Nwabali, who became a national hero following his stellar performance at the previous tournament in Cote d'Ivoire, admitted that letting in a goal feels like a personal failure, regardless of the match's final outcome.\n\nThe Chippa United goalkeeper explained that his primary motivation on the pitch is to provide a sense of security for his teammates and the millions of Nigerians watching. \"It pains me when I concede,\" Nwabali stated, emphasizing that he views every clean sheet as a testament to the hard work of the entire defensive unit. He noted that while strikers get the glory for scoring, a goalkeeper's pride rests solely on maintaining a \"zero\" on the scoreboard, and losing that zero affects his mood even after the final whistle.\n\nNwabali also touched upon the pressure of wearing the Nigerian jersey, acknowledging the high expectations from fans who have historically been spoiled with legendary goalkeepers. He noted that the modern game is more demanding, requiring goalkeepers to be active participants in the buildup play while maintaining elite shot-stopping reflexes.\n\nLooking ahead to the upcoming AFCON, Nwabali expressed confidence in the Super Eagles' defensive setup. He credited the coaching staff for instilling a disciplined approach and urged his defenders to remain focused throughout the 90 minutes. For Nwabali, the goal is simple: minimize errors, frustrate opponents, and ensure that Nigeria’s backline remains an impenetrable fortress as they chase their fourth continental title. He concluded by promising fans that he would continue to play with his heart on his sleeve, driven by the \"pain\" of conceding to keep his net empty.",
        "date": "2025-12-29T13:31:17.761Z"
      },
      {
        "category": "sports",
        "title": "2025 Globe Soccer Awards: Dembele, Yamal, and Ronaldo Claim Top Honors in Dubai",
        "image": "https://i.postimg.cc/hPMhd4VQ/IMG-20251228-202206-622.jpg",
        "summary": "The 16th annual Globe Soccer Awards took place in Dubai, celebrating football's elite with Ousmane Dembele, Lamine Yamal, and Cristiano Ronaldo among the night's biggest winners.",
        "fullText": "The football world gathered in Dubai this Sunday for the 16th edition of the Globe Soccer Awards, where the industry's top performers of the past year were officially recognized. Paris Saint-Germain's Ousmane Dembele took home the prestigious Best Men's Player award, beating out stiff competition from the likes of Kylian Mbappe and Lamine Yamal. However, Yamal did not leave empty-handed, as the Barcelona starlet was named Best Forward.\nCristiano Ronaldo continued his legacy of success in the region, securing the Best Middle East Player award for his performances with Al Nassr. It was also a massive night for PSG, who were named Best Men's Club, while their manager Luis Enrique took home Best Coach and Luis Campos was honored as Best Sporting Director. Other notable wins included Barcelona Women being named Best Women's Club, Vitinha winning Best Midfielder, and Desire Doue being recognized as the Best Emerging Player. The ceremony, founded by Jorge Mendes—who once again won Best Agent—remains one of the sport's premier global galas.",
        "date": "2025-12-28T19:23:28.308Z"
      },
      {
        "category": "sports",
        "title": "Arsenal Reclaim Premier League Top Spot with Gritty 2-1 Win Over Brighton",
        "image": "https://i.postimg.cc/4NdVBzK9/20251228-001226.jpg",
        "summary": "Captain Martin Ødegaard returned to the scoresheet as Arsenal survived a late Brighton surge to move back to the summit of the Premier League table.",
        "fullText": "Mikel Arteta’s Arsenal side demonstrated their title credentials once again, securing a vital 2-1 victory over Brighton & Hove Albion at a packed Emirates Stadium. The win comes as a perfect response to Manchester City’s temporary climb to the top earlier in the day.\nThe Gunners took control early when Martin Ødegaard rifled a low, left-footed shot into the bottom corner in the 14th minute—his first goal of an injury-interrupted season. Arsenal's dominance was further rewarded shortly after half-time when a dangerous Declan Rice corner was inadvertently headed into his own net by Brighton's Georginio Rutter.\nDespite being in cruise control for much of the match, the home fans were left biting their nails after Diego Gómez pulled one back for the Seagulls in the 64th minute. It took a world-class, fingertip save from David Raya in the dying moments to deny Yankuba Minteh and ensure all three points stayed in North London. Arsenal now sits two points clear at the top as they prepare for a festive clash against Aston Villa.",
        "date": "2025-12-28T06:30:28.711Z"
      },
      {
        "category": "sports",
        "title": "Super Eagles Survive Nervy Finish to Defeat Tunisia 3-2 in AFCON Thriller",
        "image": "https://i.postimg.cc/cL1Wppbx/20251227-235657.jpg",
        "summary": "Nigeria has secured a spot in the AFCON Round of 16 after a dramatic 5-goal thriller against Tunisia. Victor Osimhen, Wilfred Ndidi, and Ademola Lookman all found the net to seal the victory.",
        "fullText": "Nigeria’s Super Eagles maintained their perfect start to the 2025 AFCON campaign with a pulsating 3-2 victory over the Carthage Eagles of Tunisia at the Fez Stadium in Morocco.\nVictor Osimhen opened the scoring in the 44th minute with a clinical header, silencing critics and bagging his first goal of the tournament. Captain Wilfred Ndidi doubled the lead early in the second half, followed by a brilliant strike from Ademola Lookman to make it 3-0 by the 70th minute.\nHowever, the game took a tense turn as Tunisia fought back with goals from Talbi and a late penalty from Abdi. Despite a frantic final ten minutes, Stanley Nwabali and the Nigerian defense held firm to claim all three points. Nigeria now advances to face Uganda in the Round of 16 on Tuesday.",
        "date": "2025-12-27T23:05:01.640Z"
      }
    ],
    "fashion": [
      {
        "category": "fashion",
        "title": "The Evolution of the 'Naked Dress': Why the Risqué Fashion Trend is Dominating 2025",
        "image": "https://i.postimg.cc/yxXSDFTC/Screenshot-2025-12-28-212913.png",
        "summary": "Once reserved for shock value on the red carpet, the sheer \"naked dress\" has transitioned into a mainstream fashion staple in 2025, reflecting shifting cultural views on body positivity and gender.",
        "fullText": "As 2025 draws to a close, fashion critics and industry insiders are reflecting on the year’s most persistent and controversial silhouette: the \"naked dress.\" What began decades ago as a daring choice for icons like Cher and Marilyn Monroe has evolved into a sophisticated, multi-billion dollar trend that dominated runways from Paris to New York this year. However, unlike the shock-tactic sheer gowns of the past, 2025's iteration of the trend is being driven by a new set of cultural values centered on bodily autonomy and radical self-expression.\n\nDesigners have moved beyond simple transparency, utilizing intricate 3D printing, laser-cut lace, and innovative \"trompe l'oeil\" fabrics that create the illusion of nudity while maintaining a high-fashion architectural structure. This shift has allowed the trend to move from celebrity galas into premium ready-to-wear collections. Industry analysts point out that the popularity of sheer garments is no longer just about sex appeal; it is a direct response to a post-pandemic desire for liberation and a rejection of traditional, restrictive clothing norms.\n\nThe trend has also seen a significant rise in the menswear sector. In 2025, male celebrities and influencers have increasingly embraced sheer fabrics and mesh tops, signaling a broader societal shift toward gender-fluid fashion. This \"degendering\" of the naked dress has helped it remain relevant throughout the year, as consumers look for ways to challenge classic silhouettes. Despite occasional pushback from more conservative fashion circles, the \"naked\" aesthetic has proven its staying power by adapting to different body types and cultural contexts.\n\nHowever, the trend isn't without its complexities. Environmental advocates have raised concerns regarding the synthetic materials often used to achieve the desired sheer effect, urging designers to find sustainable, bio-based alternatives. As we look toward 2026, the question remains whether the fashion world will continue to peel back the layers or if a return to more modest, structured \"armor-like\" clothing is on the horizon. For now, the sheer gown remains the definitive symbol of 2025's bold and unfiltered approach to personal style.",
        "date": "2025-12-28T20:32:11.467Z"
      }
    ],
    "all": [
      {
        "category": "sports",
        "title": "\"It Pains Me When I Concede\" – Super Eagles Goalkeeper Stanley Nwabali Opens Up",
        "image": "https://i.postimg.cc/Pqhttps://i.postimg.cc/kG62HSy1/Screenshot-2025-12-29-131419.png",
        "summary": "Super Eagles shot-stopper Stanley Nwabali has expressed his deep passion for keeping clean sheets, revealing the emotional toll of conceding goals as Nigeria prepares for the 2025 Africa Cup of Nations.",
        "fullText": "As the countdown to the 2025 Africa Cup of Nations (AFCON) intensifies, Nigeria’s first-choice goalkeeper, Stanley Nwabali, has shared insights into his competitive mindset and his obsession with defensive perfection. Nwabali, who became a national hero following his stellar performance at the previous tournament in Cote d'Ivoire, admitted that letting in a goal feels like a personal failure, regardless of the match's final outcome.\n\nThe Chippa United goalkeeper explained that his primary motivation on the pitch is to provide a sense of security for his teammates and the millions of Nigerians watching. \"It pains me when I concede,\" Nwabali stated, emphasizing that he views every clean sheet as a testament to the hard work of the entire defensive unit. He noted that while strikers get the glory for scoring, a goalkeeper's pride rests solely on maintaining a \"zero\" on the scoreboard, and losing that zero affects his mood even after the final whistle.\n\nNwabali also touched upon the pressure of wearing the Nigerian jersey, acknowledging the high expectations from fans who have historically been spoiled with legendary goalkeepers. He noted that the modern game is more demanding, requiring goalkeepers to be active participants in the buildup play while maintaining elite shot-stopping reflexes.\n\nLooking ahead to the upcoming AFCON, Nwabali expressed confidence in the Super Eagles' defensive setup. He credited the coaching staff for instilling a disciplined approach and urged his defenders to remain focused throughout the 90 minutes. For Nwabali, the goal is simple: minimize errors, frustrate opponents, and ensure that Nigeria’s backline remains an impenetrable fortress as they chase their fourth continental title. He concluded by promising fans that he would continue to play with his heart on his sleeve, driven by the \"pain\" of conceding to keep his net empty.",
        "date": "2025-12-29T13:31:17.761Z"
      },
      {
        "category": "local",
        "title": "Justice Served: DSS Apprehends Kidnappers Behind 2023 Abduction and Murder of Neurology Professor",
        "image": "https://i.postimg.cc/Pqqps0fH/Screenshot-2025-12-29-122741.png",
        "summary": "The Department of State Services (DSS) has successfully tracked down and arrested the criminal gang responsible for the kidnapping and subsequent killing of a prominent Professor of Neurology over a year ago",
        "fullText": "In a significant breakthrough for Nigeria's domestic intelligence agency, the Department of State Services (DSS) has announced the arrest of a notorious kidnapping syndicate linked to the tragic death of a distinguished Professor of Neurology. The academic, whose abduction in 2023 sent shockwaves through the medical and academic communities, was killed by his captors despite negotiations, a crime that led to a long-term undercover investigation by state operatives.\n\nThe DSS revealed that the suspects were apprehended following a coordinated sting operation that spanned multiple states. Investigators utilized advanced forensic tracking and human intelligence to locate the gang members, who had been on the run since the incident. During the arrests, security forces recovered several items linking the group to the crime scene, as well as weaponry used in their various operations across the region.\n\nThe agency noted that the gang confessed to the abduction, admitting that the professor was targeted due to his perceived profile. The suspects further disclosed the location of the remains, which has allowed the authorities to conclude a significant portion of the investigation. This successful operation is being hailed as a major win for the DSS in its ongoing battle against high-profile kidnapping rings that have targeted professionals and academics in recent years.\n\nThe suspects are currently in custody and are expected to be arraigned in court as soon as preliminary judicial processes are completed. The DSS reaffirmed its commitment to tracking down all individuals involved in violent crimes, stressing that the delay in the arrest was due to the meticulous nature of the evidence-gathering required to ensure a successful prosecution and to dismantle the entire network associated with the group.",
        "date": "2025-12-29T11:42:10.123Z"
      },
      {
        "category": "fashion",
        "title": "The Evolution of the 'Naked Dress': Why the Risqué Fashion Trend is Dominating 2025",
        "image": "https://i.postimg.cc/yxXSDFTC/Screenshot-2025-12-28-212913.png",
        "summary": "Once reserved for shock value on the red carpet, the sheer \"naked dress\" has transitioned into a mainstream fashion staple in 2025, reflecting shifting cultural views on body positivity and gender.",
        "fullText": "As 2025 draws to a close, fashion critics and industry insiders are reflecting on the year’s most persistent and controversial silhouette: the \"naked dress.\" What began decades ago as a daring choice for icons like Cher and Marilyn Monroe has evolved into a sophisticated, multi-billion dollar trend that dominated runways from Paris to New York this year. However, unlike the shock-tactic sheer gowns of the past, 2025's iteration of the trend is being driven by a new set of cultural values centered on bodily autonomy and radical self-expression.\n\nDesigners have moved beyond simple transparency, utilizing intricate 3D printing, laser-cut lace, and innovative \"trompe l'oeil\" fabrics that create the illusion of nudity while maintaining a high-fashion architectural structure. This shift has allowed the trend to move from celebrity galas into premium ready-to-wear collections. Industry analysts point out that the popularity of sheer garments is no longer just about sex appeal; it is a direct response to a post-pandemic desire for liberation and a rejection of traditional, restrictive clothing norms.\n\nThe trend has also seen a significant rise in the menswear sector. In 2025, male celebrities and influencers have increasingly embraced sheer fabrics and mesh tops, signaling a broader societal shift toward gender-fluid fashion. This \"degendering\" of the naked dress has helped it remain relevant throughout the year, as consumers look for ways to challenge classic silhouettes. Despite occasional pushback from more conservative fashion circles, the \"naked\" aesthetic has proven its staying power by adapting to different body types and cultural contexts.\n\nHowever, the trend isn't without its complexities. Environmental advocates have raised concerns regarding the synthetic materials often used to achieve the desired sheer effect, urging designers to find sustainable, bio-based alternatives. As we look toward 2026, the question remains whether the fashion world will continue to peel back the layers or if a return to more modest, structured \"armor-like\" clothing is on the horizon. For now, the sheer gown remains the definitive symbol of 2025's bold and unfiltered approach to personal style.",
        "date": "2025-12-28T20:32:11.467Z"
      },
      {
        "category": "international",
        "title": "Historic Florida Summit: Trump Hosts Zelenskyy in Bid to Negotiate Russia-Ukraine Peace",
        "image": "https://i.postimg.cc/RhcZP469/Screenshot-2025-12-28-212123.png",
        "summary": "U.S. President Donald Trump is hosting Ukrainian President Volodymyr Zelenskyy in Florida today for high-stakes talks aimed at establishing a ceasefire and a lasting peace agreement.",
        "fullText": "In a pivotal moment for global diplomacy, President Donald Trump met with Ukrainian President Volodymyr Zelenskyy at his Florida estate this Sunday. The meeting follows what Trump described as a \"very productive\" phone call with Russian President Vladimir Putin earlier in the day. Zelenskyy told reporters that the primary focus of the discussion is securing long-term security guarantees for Ukraine as they look toward an end to the nearly four-year conflict.\n\nThe summit comes amid a backdrop of intensified Russian strikes on Kyiv and shifting U.S. foreign policy. While the Kremlin has expressed a willingness to talk, the Ukrainian leadership remains cautious, emphasizing that any deal must protect their nation's sovereignty. Analysts suggest this meeting could be the most significant breakthrough in peace negotiations since the war began, as the Trump administration pushes for a rapid resolution to the crisis. Updates from the Florida summit are expected throughout the evening.",
        "date": "2025-12-28T20:22:13.808Z"
      },
      {
        "category": "finance",
        "title": "Aviation Crisis: Air Peace CEO Warns New Tax Law Could Force ₦1 Million Base Fare",
        "image": "https://i.postimg.cc/XJRRD5Fz/Screenshot-2025-12-28-211245.png",
        "summary": "Air Peace Chairman, Allen Onyema, has cautioned that the reintroduction of certain taxes and duties could lead to a collapse of the aviation sector and sky-high ticket prices for Nigerians.",
        "fullText": "     The Chairman of Air Peace, Dr. Allen Onyema, has raised an alarm over a proposed new tax regime that could see domestic airfares soar to a ₦1 million base rate. Speaking at a recent aviation conference in Lagos, Onyema warned that the implementation of policies such as customs duties on imported aircraft, spare parts, and a 7.5% VAT on fares would be \"disastrous\" for the industry. He stated that these financial burdens would likely cause many Nigerian airlines to collapse within 48 hours of enforcement.\n\n     Onyema emphasized that Nigerian carriers are already struggling with high operating costs and multiple existing taxes, including the 5% ticket sales charge. He urged the government to review these laws to prevent the \"death\" of local aviation, suggesting that the industry should focus on cost-recovery rather than aggressive taxation. While he praised Aviation Minister Festus Keyamo for addressing these concerns, the Air Peace boss maintained that without a permanent shift in policy, air travel could become unaffordable for the average Nigerian.",
        "date": "2025-12-28T20:09:55.861Z"
      },
      {
        "category": "tech",
        "title": "Israel's Tech Sector Faces Brain Drain Crisis as Staff Seek Relocation Abroad",
        "image": "https://i.postimg.cc/zvxsjQzk/Screenshot-2025-12-28-205438.png",
        "summary": "A new report reveals a significant rise in Israeli technology workers seeking to move overseas, driven by ongoing regional instability and economic uncertainty.",
        "fullText": "The backbone of Israel's economy is showing signs of strain as a growing number of tech professionals explore opportunities outside the country. According to a recent industry report, the prolonged conflict and the resulting social and economic volatility have triggered a surge in relocation requests among high-tech employees. This trend poses a serious threat to Israel's status as a global innovation hub, as the \"Startup Nation\" risks losing its most valuable talent to more stable markets in Europe and North America.\n\nTech leaders and CEOs expressed concern that the flight of human capital could lead to a long-term decline in domestic investment and research development. While the sector has remained resilient during previous crises, the current data suggests that the duration of the unrest is pushing even senior-level engineers and entrepreneurs to seek a more predictable future elsewhere. Experts warn that without significant shifts in the geopolitical climate or targeted government intervention to retain talent, the exodus could permanently reshape the landscape of the Israeli technology industry.",
        "date": "2025-12-28T19:55:29.689Z"
      },
      {
        "category": "sports",
        "title": "2025 Globe Soccer Awards: Dembele, Yamal, and Ronaldo Claim Top Honors in Dubai",
        "image": "https://i.postimg.cc/hPMhd4VQ/IMG-20251228-202206-622.jpg",
        "summary": "The 16th annual Globe Soccer Awards took place in Dubai, celebrating football's elite with Ousmane Dembele, Lamine Yamal, and Cristiano Ronaldo among the night's biggest winners.",
        "fullText": "The football world gathered in Dubai this Sunday for the 16th edition of the Globe Soccer Awards, where the industry's top performers of the past year were officially recognized. Paris Saint-Germain's Ousmane Dembele took home the prestigious Best Men's Player award, beating out stiff competition from the likes of Kylian Mbappe and Lamine Yamal. However, Yamal did not leave empty-handed, as the Barcelona starlet was named Best Forward.\nCristiano Ronaldo continued his legacy of success in the region, securing the Best Middle East Player award for his performances with Al Nassr. It was also a massive night for PSG, who were named Best Men's Club, while their manager Luis Enrique took home Best Coach and Luis Campos was honored as Best Sporting Director. Other notable wins included Barcelona Women being named Best Women's Club, Vitinha winning Best Midfielder, and Desire Doue being recognized as the Best Emerging Player. The ceremony, founded by Jorge Mendes—who once again won Best Agent—remains one of the sport's premier global galas.",
        "date": "2025-12-28T19:23:28.308Z"
      },
      {
        "category": "local",
        "title": "Terrorists Relocate After US Air Strikes in Nigeria",
        "image": "https://i.postimg.cc/Kj6m1JNf/20251228-102608.jpg",
        "summary": "Reports say suspected terrorists in northwest Nigeria are moving locations after US-led air strikes disrupted their camps. Community leaders and officials warn security risks remain high.",
        "fullText": "Residents in parts of northwest Nigeria report unusual movement of armed groups following recent US military air strikes. The strikes targeted locations believed to serve as terrorist hideouts during the Christmas period.\nCommunity leaders say the attacks forced the groups to abandon fixed camps and split into smaller units. Many reportedly moved through forest routes and rural corridors to avoid detection.\nIn some affected areas, residents confirmed damage to farmland and nearby structures. A few civilians sustained injuries, increasing tension among local populations.\nTraditional rulers and security sources warn the relocation poses new risks. Armed groups entering unfamiliar communities often seek supplies, shelter, or recruits.\nSecurity agencies have increased patrols and surveillance across border towns and forest zones. Officials say coordinated operations are underway to block escape paths and prevent regrouping.\nAnalysts stress the need for stronger intelligence sharing and sustained pressure. Without follow up action, displaced groups often reorganize and resume attacks.",
        "date": "2025-12-28T09:26:39.526Z"
      },
      {
        "category": "sports",
        "title": "Arsenal Reclaim Premier League Top Spot with Gritty 2-1 Win Over Brighton",
        "image": "https://i.postimg.cc/4NdVBzK9/20251228-001226.jpg",
        "summary": "Captain Martin Ødegaard returned to the scoresheet as Arsenal survived a late Brighton surge to move back to the summit of the Premier League table.",
        "fullText": "Mikel Arteta’s Arsenal side demonstrated their title credentials once again, securing a vital 2-1 victory over Brighton & Hove Albion at a packed Emirates Stadium. The win comes as a perfect response to Manchester City’s temporary climb to the top earlier in the day.\nThe Gunners took control early when Martin Ødegaard rifled a low, left-footed shot into the bottom corner in the 14th minute—his first goal of an injury-interrupted season. Arsenal's dominance was further rewarded shortly after half-time when a dangerous Declan Rice corner was inadvertently headed into his own net by Brighton's Georginio Rutter.\nDespite being in cruise control for much of the match, the home fans were left biting their nails after Diego Gómez pulled one back for the Seagulls in the 64th minute. It took a world-class, fingertip save from David Raya in the dying moments to deny Yankuba Minteh and ensure all three points stayed in North London. Arsenal now sits two points clear at the top as they prepare for a festive clash against Aston Villa.",
        "date": "2025-12-28T06:30:28.711Z"
      },
      {
        "category": "sports",
        "title": "Super Eagles Survive Nervy Finish to Defeat Tunisia 3-2 in AFCON Thriller",
        "image": "https://i.postimg.cc/cL1Wppbx/20251227-235657.jpg",
        "summary": "Nigeria has secured a spot in the AFCON Round of 16 after a dramatic 5-goal thriller against Tunisia. Victor Osimhen, Wilfred Ndidi, and Ademola Lookman all found the net to seal the victory.",
        "fullText": "Nigeria’s Super Eagles maintained their perfect start to the 2025 AFCON campaign with a pulsating 3-2 victory over the Carthage Eagles of Tunisia at the Fez Stadium in Morocco.\nVictor Osimhen opened the scoring in the 44th minute with a clinical header, silencing critics and bagging his first goal of the tournament. Captain Wilfred Ndidi doubled the lead early in the second half, followed by a brilliant strike from Ademola Lookman to make it 3-0 by the 70th minute.\nHowever, the game took a tense turn as Tunisia fought back with goals from Talbi and a late penalty from Abdi. Despite a frantic final ten minutes, Stanley Nwabali and the Nigerian defense held firm to claim all three points. Nigeria now advances to face Uganda in the Round of 16 on Tuesday.",
        "date": "2025-12-27T23:05:01.640Z"
      }
    ]
  }
}
